## Plan Result (656: reform_cft_vh_dev_acme - TerraformPlanApply)




<pre><code>Plan: 11 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azuread_group_member.dnszonecontributor
  * azurerm_key_vault.kv
  * azurerm_resource_group.rg
  * azurerm_role_assignment.Reader
  * azurerm_role_assignment.kvaccess
  * azurerm_role_assignment.kvgroupaccess
  * azurerm_service_plan.asp
  * azurerm_storage_account.stg
  * azurerm_windows_function_app.funcapp
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azuread_group_member.dnszonecontributor will be created
  + resource "azuread_group_member" "dnszonecontributor" {
      + group_object_id  = "a02b18e4-fba7-4d7d-9603-07e128f4126a"
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_deployment        = true
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "acmereformcftvhdev"
      + public_network_access_enabled = true
      + resource_group_name           = "cft-platform-dev-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "cft-platform-dev-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
    }

  # azurerm_role_assignment.Reader will be created
  + resource "azurerm_role_assignment" "Reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.kvaccess will be created
  + resource "azurerm_role_assignment" "kvaccess" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.kvgroupaccess will be created
  + resource "azurerm_role_assignment" "kvgroupaccess" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_service_plan.asp will be created
  + resource "azurerm_service_plan" "asp" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "uksouth"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "cft-platform-dev-asp"
      + os_type                         = "Windows"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "cft-platform-dev-rg"
      + sku_name                        = "Y1"
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + worker_count                    = (known after apply)
    }

  # azurerm_storage_account.stg will be created
  + resource "azurerm_storage_account" "stg" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "acmereformcftvhdev"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "cft-platform-dev-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_windows_function_app.funcapp will be created
  + resource "azurerm_windows_function_app" "funcapp" {
      + app_settings                                   = (sensitive value)
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = (known after apply)
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "acmereformcftvhdev"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "cft-platform-dev-rg"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "acmereformcftvhdev"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + auth_settings {
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = "AzureActiveDirectory"
          + enabled                        = true
          + issuer                         = "https://sts.windows.net/531ff96d-0ae9-462a-8d2d-bec7c0b42082/"
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = 72
          + token_store_enabled            = false
          + unauthenticated_client_action  = "RedirectToLoginPage"

          + active_directory {
              + client_id = "b5ef8e6a-ebc3-434c-86b2-aea35405d65e"
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                              = (known after apply)
          + app_scale_limit                        = (known after apply)
          + application_insights_connection_string = (sensitive value)
          + default_documents                      = (known after apply)
          + detailed_error_logging_enabled         = (known after apply)
          + elastic_instance_minimum               = (known after apply)
          + ftps_state                             = "Disabled"
          + http2_enabled                          = false
          + ip_restriction_default_action          = "Allow"
          + load_balancing_mode                    = "LeastRequests"
          + managed_pipeline_mode                  = "Integrated"
          + minimum_tls_version                    = "1.2"
          + pre_warmed_instance_count              = (known after apply)
          + remote_debugging_enabled               = false
          + remote_debugging_version               = (known after apply)
          + scm_ip_restriction_default_action      = "Allow"
          + scm_minimum_tls_version                = "1.2"
          + scm_type                               = (known after apply)
          + scm_use_main_ip_restriction            = false
          + use_32_bit_worker                      = true
          + vnet_route_all_enabled                 = false
          + websockets_enabled                     = false
          + windows_fx_version                     = (known after apply)
          + worker_count                           = (known after apply)

          + application_stack {
              + dotnet_version              = "v8.0"
              + use_custom_runtime          = (known after apply)
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "cft-platform-dev"
      + resource_group_name                   = "cft-platform-dev-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 1
      + tags                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application-Insights-daily-cap-reached-cft-platform-dev"
      + resource_group_name = "cft-platform-dev-rg"
      + scopes              = (known after apply)
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + action {
          + action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = null
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_key_vault.kv has been deleted
  - resource "azurerm_key_vault" "kv" {
      - id                              = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/resourceGroups/cft-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmereformcftvhdev" -> null
        name                            = "acmereformcftvhdev"
        tags                            = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise-acme"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
        }
      - vault_uri                       = "https://acmereformcftvhdev.vault.azure.net/" -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.rg has been deleted
  - resource "azurerm_resource_group" "rg" {
      - id         = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/resourceGroups/cft-platform-dev-rg" -> null
      - name       = "cft-platform-dev-rg" -> null
        tags       = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise-acme"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_service_plan.asp has been deleted
  - resource "azurerm_service_plan" "asp" {
      - id                              = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/resourceGroups/cft-platform-dev-rg/providers/Microsoft.Web/serverFarms/cft-platform-dev-asp" -> null
        name                            = "cft-platform-dev-asp"
        tags                            = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise-acme"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_storage_account.stg has been deleted
  - resource "azurerm_storage_account" "stg" {
        id                                 = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/resourceGroups/cft-platform-dev-rg/providers/Microsoft.Storage/storageAccounts/acmereformcftvhdev"
      - name                               = "acmereformcftvhdev" -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_connection_string          = (sensitive value) -> null
        tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise-acme"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (94 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_function_app.funcapp has been deleted
  - resource "azurerm_windows_function_app" "funcapp" {
        id                                             = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/resourceGroups/cft-platform-dev-rg/providers/Microsoft.Web/sites/acmereformcftvhdev"
        name                                           = "acmereformcftvhdev"
        tags                                           = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise-acme"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (34 unchanged attributes hidden)

      - identity {
          - principal_id = "c560a902-d38b-4906-a35f-fd69fb6c0a90" -> null
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.application_insights.azurerm_application_insights.this has been deleted
  - resource "azurerm_application_insights" "this" {
      - app_id                                = "3baf164d-c15e-4936-8584-d3b3ab2c6da3" -> null
      - connection_string                     = (sensitive value) -> null
      - id                                    = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/resourceGroups/cft-platform-dev-rg/providers/Microsoft.Insights/components/cft-platform-dev" -> null
      - instrumentation_key                   = (sensitive value) -> null
      - name                                  = "cft-platform-dev" -> null
        tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise-acme"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



## :warning: Errors

* failed to add a label 656: reform_cft_vh_dev_acme - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":38,"Program":"tfcmt","SHA1":"","Target":"656: reform_cft_vh_dev_acme - TerraformPlanApply","Vars":{}} -->